# 5-2 변수와 자료형 - 변수 선언 시 주의 사항

# Naming Convention(명명 규칙)

# 1. 변수 사이의 공백은 허용되지 않는다.
# greet ing, my greeting 등 띄어쓰기나 공백 등을 포함한 이런건 안된다는 것
greeting = "안녕하세요"

# 2. 1.을 해결하기 위해 단어 사이는 _(언더스코어)를 사용하여 연결
my_greet = "안녕하세요"
myString = "hi"

# 3. 변수를 선언하기 위한 문자열은 숫자, 특수문자로 시작이 불가하다.
# 1_greeting, !_greeting 이런건 안된다는 것.
# 앞에 시작하는 문자는 반드시 영문자로 해줘야함. 그 뒤는 상관 X
greeting_1 = "안녕"

# 4. 예약어는 변수로 선언이 불가하다.
# print = "안녕" 이런것이 안된다는 것

# 5. 변수는 가급적 소문자를 사용하는 것이 좋음.

# 6. 오타를 주의해야하는 것이 가장 중요!
# Ctrl-F를 통해 직접 검색을 해서 찾을 수도 있음.